# CreationFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MatchlineFailures..::..CreationFailed Property
BuiltInFailures..::..MatchlineFailures Class See Also
---
Matchline top extent should be higher than its bottom.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CreationFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CreationFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CreationFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MatchlineFailures Class
Autodesk.Revit.DB Namespace